{"CENG1980": {"COURSE_INFO": {"DESCRIPTION": "A practical training course in an industrial simulated environment. For students of the Chemical and Biological Engineering Department only. Graded P, PP or F."}, "SECTIONS": [{"Section": "R1 (1019)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LIU, Y.S. Marshal", "Quota": "5", "Enrol": "2", "Avail": "3", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline: 07-Jan-2023"}}]}, "CENG6900C": {"COURSE_INFO": {"VECTOR": "[1 credit]", "EXCLUSION": "CENG 6800", "PREVIOUS CODE": "CENG 690C", "DESCRIPTION": "Selected topics in chemical engineering studied under the supervision of a faculty member. Graded P or F."}, "SECTIONS": [{"Section": "R1 (1021)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "TBA", "Quota": "4", "Enrol": "1", "Avail": "3", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline: 07-Jan-2023; > Extended Drop Deadline: 14-Jan-2023"}}]}, "CIVL3020": {"COURSE_INFO": {"PRE-REQUISITE": "CIVL 2020", "DESCRIPTION": "For students of the Civil and Environmental Engineering Department only. Internship training provides students the opportunity to gain professional experience and to apply theories to real-life situations. Students are required to complete a minimum of six weeks on-the-job training in civil engineering consulting firms, contractors, developers or relevant government departments, or an equivalent of 5-week mock construction training under the supervision of professional practitioners. Graded P or F."}, "SECTIONS": [{"Section": "R1 (1023)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "TBA", "Quota": "40", "Enrol": "30", "Avail": "10", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline: 07-Jan-2023"}}]}, "CIVL4910": {"COURSE_INFO": {"EXCLUSION": "CIVL 4920", "DESCRIPTION": "The two-term Final Year Project involves applications of civil and environmental engineering principles to the design, planning, experimental or analytical investigation of current engineering design and research problems. The credit load will be spread over two terms. For CIVL and CIEV students in their final year of study only. May be graded PP."}, "SECTIONS": [{"Section": "T1 (1024)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "TBA", "Quota": "1", "Enrol": "1", "Avail": "0", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline: 07-Jan-2023"}}]}, "CIVL6050D": {"COURSE_INFO": {"VECTOR": "[1-0-0:0]", "DESCRIPTION": "Discussion of current research by faculty members, and guest lectures on recent advances in civil engineering. Graded P or F."}, "SECTIONS": [{"Section": "L1 (1026)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "TBA", "Quota": "5", "Enrol": "0", "Avail": "5", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline: 07-Jan-2023; > Extended Drop Deadline: 14-Jan-2023"}}]}, "CIVL6060I": {"COURSE_INFO": {"VECTOR": "[1-0-0:0]", "DESCRIPTION": "Presentation of current graduate research by postgraduate students. Graded P or F."}, "SECTIONS": [{"Section": "L1 (1027)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "TBA", "Quota": "5", "Enrol": "0", "Avail": "5", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline: 07-Jan-2023; > Extended Drop Deadline: 14-Jan-2023"}}]}, "COMP1029C": {"COURSE_INFO": {"PRE-REQUISITE": "COMP 1021 OR COMP 1022P OR COMP 1022Q (prior to 2020-21) OR ISOM 3230 OR ISOM 3320", "EXCLUSION": "COMP 2011, COMP 2012H", "DESCRIPTION": "This course introduces the C programming language. It is intended for students who already have some experience in computer programming but wish to learn how to apply those programming skills to the C language. The course covers basic programming topics, such as variables, control, loops, and functions, to more advanced topics. Students explore these by self-learning of course materials together with guided programming exercises. Students without the prerequisites but possess relevant programming knowledge may seek instructor's approval for enrolling in the course. Graded P or F."}, "SECTIONS": [{"Section": "L1 (1028)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LAM, Gibson", "Quota": "50", "Enrol": "50", "Avail": "0", "Wait": "23", "Remarks": {"consent": false, "info": "> Add/Drop Deadline: 07-Jan-2023"}}, {"Section": "LA1 (1029)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LAM, Gibson", "Quota": "50", "Enrol": "50", "Avail": "0", "Wait": "23", "Remarks": {"consent": false}}]}, "COMP1029J": {"COURSE_INFO": {"PRE-REQUISITE": "COMP 1021 OR COMP 1022Q (prior to 2020-21) OR ISOM 3230", "EXCLUSION": "COMP 1022P, COMP 3021, ISOM 3320", "DESCRIPTION": "This course introduces the Java programming language. It is intended for students who already have some experience in computer programming but wish to learn how to apply those programming skills to the Java language. The course covers basic programming topics such as variables, control statements, loops, functions, and object-oriented programming concepts. Students explore these by self-learning of course materials together with guided programming exercises. Students without the prerequisites but possess relevant programming knowledge may seek instructor's approval for enrolling in the course. Graded P or F."}, "SECTIONS": [{"Section": "L1 (1030)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LAM, Gibson", "Quota": "50", "Enrol": "50", "Avail": "0", "Wait": "16", "Remarks": {"consent": false, "info": "> Add/Drop Deadline: 07-Jan-2023"}}, {"Section": "LA1 (1031)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LAM, Gibson", "Quota": "50", "Enrol": "50", "Avail": "0", "Wait": "16", "Remarks": {"consent": false}}]}, "COMP1029P": {"COURSE_INFO": {"PRE-REQUISITE": "COMP 1022P OR COMP 1022Q (prior to 2020-21) OR ISOM 3230 OR ISOM 3320", "EXCLUSION": "COMP 1021", "DESCRIPTION": "This course introduces the Python programming language. It is intended for students who already have some experience in computer programming but wish to learn how to apply those programming skills to the Python language. The course covers basic programming topics, such as variables, functions and loops, to more advanced topics. Students explore these by self-learning of course materials together with guided programming exercises. Students without the prerequisites but possess relevant programming knowledge may seek instructor's approval for enrolling in the course. Graded P or F."}, "SECTIONS": [{"Section": "L1 (1032)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LAM, Gibson", "Quota": "50", "Enrol": "17", "Avail": "33", "Wait": "0", "Remarks": {"consent": false, "info": "> Add/Drop Deadline: 07-Jan-2023"}}, {"Section": "LA1 (1033)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LAM, Gibson", "Quota": "50", "Enrol": "17", "Avail": "33", "Wait": "0", "Remarks": {"consent": false}}]}, "COMP1029V": {"COURSE_INFO": {"PRE-REQUISITE": "COMP 1021 OR COMP 1022P OR ISOM 3320", "EXCLUSION": "COMP 1022Q (prior to 2020-21), ISOM 3230", "DESCRIPTION": "This course introduces the VBA programming language, in the context of Microsoft Excel. It is intended for students who already have some experience in computer programming but wish to learn how to apply those programming skills to VBA, within Excel. The course covers basic programming topics, such as variables, functions and loops, to more advanced topics. Appropriate features of the Excel program are also covered. Students explore these by self-learning of course materials together with guided programming exercises. Students without the prerequisites but possess relevant programming knowledge may seek instructor's approval for enrolling in the course. Graded P or F."}, "SECTIONS": [{"Section": "L1 (1034)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LAM, Gibson", "Quota": "50", "Enrol": "50", "Avail": "0", "Wait": "10", "Remarks": {"consent": false, "info": "> Add/Drop Deadline: 07-Jan-2023"}}, {"Section": "LA1 (1035)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LAM, Gibson", "Quota": "50", "Enrol": "50", "Avail": "0", "Wait": "10", "Remarks": {"consent": false}}]}, "COMP4900": {"COURSE_INFO": {"DESCRIPTION": "This course is for academic and professional development of students in the programs offered by the Department of Computer Science and Engineering. Activities may include seminars, workshops, advising and sharing sessions, interaction with faculty and teaching staff, and discussion with student peers or alumni. Graded P/PP/F."}, "SECTIONS": [{"Section": "T1 (1070)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LI, Xin", "Quota": "1", "Enrol": "1", "Avail": "0", "Wait": "0", "Remarks": {"consent": false}}]}, "COMP4910": {"COURSE_INFO": {"EXCLUSION": "COMP 4981, COMP 4981H", "DESCRIPTION": "Students in this co-op program will be engaged in practical hands-on training for a period of at least 5 months working in an organization or company that provides qualified training relevant to the computer engineering profession. Students are required to complete a final year project under the supervision of an industrial supervisor and a faculty member during the co-op. May be graded PP. For COMP and COSC students in their third or fourth year of study only. Approval of the course coordinator is required for enrollment in the course."}, "SECTIONS": [{"Section": "R1 (1078)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "TBA", "Quota": "1", "Enrol": "1", "Avail": "0", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline: 07-Jan-2023"}}]}, "COMP4971C": {"COURSE_INFO": {"PREVIOUS CODE": "COMP 390C", "DESCRIPTION": "Independent studies or projects under the directed guidance of a faculty member on a computer science topic. A written report, presentation, and/or an examination are required. Enrollment in the course requires prior approval of the course instructor, and credits assigned depend on the workload. May be repeated for credits."}, "SECTIONS": [{"Section": "R1 (1080)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "HORNER, Andrew", "Quota": "1", "Enrol": "0", "Avail": "1", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline: 07-Jan-2023"}}]}, "COMP6921B": {"COURSE_INFO": {"VECTOR": "[1 credit]", "PREVIOUS CODE": "COMP 694B", "DESCRIPTION": "The course will conduct a scientific study on the fault analysis and prediction of open-sourced context-aware systems. Students are required to pick up the related\r\nresearch methodology and carry out empirical experiments."}, "SECTIONS": [{"Section": "R1 (1082)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "CHEUNG, Shing-Chi", "Quota": "1", "Enrol": "1", "Avail": "0", "Wait": "0", "Remarks": {"consent": false}}]}, "COMP6921E": {"COURSE_INFO": {"VECTOR": "[1 credit]", "DESCRIPTION": "An independent research project carried out under the supervision of a faculty member. This course is only available for exchange, visiting and visiting internship students."}, "SECTIONS": [{"Section": "R1 (1083)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "CHEN, Lei", "Quota": "1", "Enrol": "1", "Avail": "0", "Wait": "0", "Remarks": {"consent": false}}]}, "DBAP5120": {"COURSE_INFO": {"VECTOR": "[1-0-0:1]", "DESCRIPTION": "This course introduces students to frontier topics in economics research relevant for business, including topics such as innovation, globalization (trade and FDI), personnel management, industrial organization, competition, and digital economy.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Identify the latest economics research on timely, cutting-edge topics. 2. Compare and contrast the research methods and quality of evidence in economics research. 3. Identify how economics research has contributed to business design, management, and practice. 4. Conceptualize and design economics research to address selected business problems. 5. Present professional research and articulate its significance."}, "SECTIONS": [{"Section": "L1 (1066)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "HUA, Xinyu_HUANG, Yangguang_LEUNG, Siu Fai", "Quota": "10", "Enrol": "10", "Avail": "0", "Wait": "0", "Remarks": {"consent": false, "info": "> For DBA students only; > Class Duration/Dates : 12-Jan-2023 to 13-Jan-2023; > Add/Drop Deadline : 12-Jan-2023"}}]}, "DBAP5160": {"COURSE_INFO": {"VECTOR": "[1-0-0:1]", "DESCRIPTION": "This introductory course exposes students to the latest research and trends in management research (e.g., organizational behavior, human resources management, strategic management, international business, entrepreneurship, and business ethics). Students will read and critique latest research papers from selected topics and participate in class discussion. Students are expected to understand management issues of current and future concerns, identify an interesting and practically important frontier research question in a management topic of choice, and write an executable research proposal to address the question.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Recognize the latest research and trends in strategy and organization. 2. Recognize the latest research and trends in organizational behavior and human resource management. 3. Articulate current business and organizational issues relevant to the management field. 4. Develop independent scholarly research on a topic of choice in the management field. 5. Apply the latest research and knowledge in management in their business settings."}, "SECTIONS": [{"Section": "L1 (1067)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LI, J.T.", "Quota": "10", "Enrol": "10", "Avail": "0", "Wait": "0", "Remarks": {"consent": false, "info": "> For DBA students only; > Class Duration/Dates : 14-Jan-2023 to 15-Jan-2023; > Add/Drop Deadline : 14-Jan-2023"}}]}, "DBAP5220": {"COURSE_INFO": {"VECTOR": "[2-0-0:2]", "DESCRIPTION": "This course involves discussion of research in managerial accounting, auditing and corporate governance. Use of research tools in economics, finance and statistics to examine important accounting issues in the above areas will be covered.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Describe the association between corporate board structures and accounting. 2. Describe the association between corporate ownership structures and accounting. 3. Describe the association between the incentives of executives and accounting. 4. Describe the association between debt contracts and accounting. 5. Identify the current research on auditing. 6. Explain the impact of regulation on accounting and auditing. 7. Explain the impact of litigation on accounting and auditing. 8. Present professional accounting research in managerial accounting, auditing and corporate governance."}, "SECTIONS": [{"Section": "L1 (1065)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "CHEN, Tai-Yuan", "Quota": "4", "Enrol": "4", "Avail": "0", "Wait": "0", "Remarks": {"consent": false, "info": "> For DBA students only; > Class Duration/Dates : 14-Jan-2023 to 15-Jan-2023; 25-Feb-2023 to 26-Feb-2023; > Add/Drop Deadline : 14-Jan-2023"}}]}, "ECON5341": {"COURSE_INFO": {"VECTOR": "[2-0-0:2]", "PRE-REQUISITE": "ECON 3024 OR ECON 3143 OR ECON 5140", "PREVIOUS CODE": "ECON 6100R", "DESCRIPTION": "The topics to be covered in this course include an overview of tasks and responsibilities of a central bank/monetary authority; relationships of monetary policy to other forms of economic and financial stability policy; objectives of monetary policy; institutional and historical aspects of monetary policy; monetary policy transmission channels, interactions between monetary, fiscal, and exchange rate policies; tools of monetary policy; causes and dynamics of hyperinflations;  forecasting methods for inflation, output, and financial variables; international aspects of central banking and monetary policy.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Explain the role of central banks in financial regulation. 2. Describe relationships of monetary policy to other economic policies. 3. Describe goals and instruments of monetary policy. 4. Discuss pros and cons of central bank independence. 5. Identify approaches to capital controls and exchange rate policies. 6. Illustrate models of exchange rate determination. 7. Describe the role of economic forecasting at a central bank."}, "SECTIONS": [{"Section": "L1 (1062)", "Date_N_Time": "04-JAN-2023 - 20-JAN-2023_MoWeFr 02:00PM - 05:20PM", "Room": "Rm 4619, Lift 31-32 (126)", "Instructor": "LORETAN, Michael Stanislaus", "Quota": "100", "Enrol": "53", "Avail": "47", "Wait": "0", "Remarks": {"consent": false, "info": "> For MSc(ECON) students only; > Add/Drop Deadline : 05-Jan-2023"}}]}, "ECON5343": {"COURSE_INFO": {"VECTOR": "[2-0-0:2]", "PRE-REQUISITE": "ECON 5140 OR ECON 5250", "PREVIOUS CODE": "ECON 6110C", "DESCRIPTION": "The course will cover macroeconomic models of exchange rates and international capital flows. This includes the connection between monetary policy and foreign exchange markets, models of long-term growth and the real exchange rates, and business cycle models of the balance of payments.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Construct a variety of measures of exchange rates and relate them to one another. 2. Measure the components of the balance of payments  and use macroeconomic theory to explain the determinants. 3. Explain the relationship between macroeconomic policy and exchange rates and the balance of payments. 4. Explain and represent the implementation of exchange rate policy."}, "SECTIONS": [{"Section": "L1 (1063)", "Date_N_Time": "TuTh 10:00AM - 01:20PM", "Room": "Rm 4619, Lift 31-32 (126)", "Instructor": "COOK, David Edward", "Quota": "100", "Enrol": "17", "Avail": "83", "Wait": "0", "Remarks": {"consent": false, "info": "> For MSc(ECON) students only; > Add/Drop Deadline : 4-Jan-2023"}}]}, "ECON5410": {"COURSE_INFO": {"VECTOR": "[2-0-0:2]", "PRE-REQUISITE": "ECON 5400", "PREVIOUS CODE": "ECON 541, ECON 610C", "DESCRIPTION": "This course will introduce the precepts of value investing.  It will focus on the equity market, and begin with the classic Graham and Dodd investing criteria.  This includes stock search; valuation; and design of optimal portfolio.  Innovations to the classic criteria as well as use of derivates in the portfolio will be introduced.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Describe the philosophy, style and tools of value investing. 2. Apply concepts in Accounting, Microeconomics and Corporate Finance to analyze companies and their stocks. 3. Write a research report."}, "SECTIONS": [{"Section": "L1 (1064)", "Date_N_Time": "07-JAN-2023 - 15-JAN-2023_SaSu 09:00AM - 12:50PM; 07-JAN-2023 - 15-JAN-2023_SaSu 02:00PM - 04:50PM", "Room": "Rm 1001, LSK Bldg (70); Rm 1001, LSK Bldg (70)", "Instructor": "RAO, Milind Shankar; RAO, Milind Shankar", "Quota": "40", "Enrol": "11", "Avail": "29", "Wait": "0", "Remarks": {"consent": false, "info": "> For MSc(ECON) students only; > Add/Drop Deadline : 7-Jan-2023"}}]}, "EESM6980M": {"COURSE_INFO": {"VECTOR": "[4 credit(s)]", "DESCRIPTION": "Independent project carried out under the supervision of a faculty member. This course may be run repeatedly for credit(s)."}, "SECTIONS": [{"Section": "L1 (1013)", "Date_N_Time": "09-JAN-2023 - 30-JAN-2023_Mo 03:00PM - 04:50PM; 09-JAN-2023 - 30-JAN-2023_Mo 08:00PM - 09:50PM", "Room": "Rm 2303, Lift 17-18 (91); Rm 2303, Lift 17-18 (91)", "Instructor": "CHAN, Man Sun_SARFRAZ, Khawar; CHAN, Man Sun_SARFRAZ, Khawar", "Quota": "40", "Enrol": "35", "Avail": "5", "Wait": "0", "Remarks": {"consent": true}}, {"Section": "L2 (1015)", "Date_N_Time": "09-JAN-2023 - 30-JAN-2023_Mo 06:00PM - 07:50PM; 09-JAN-2023 - 30-JAN-2023_Mo 08:00PM - 09:50PM", "Room": "Rm 2303, Lift 17-18 (91); TBA", "Instructor": "CHAN, Man Sun_SARFRAZ, Khawar; CHAN, Man Sun_SARFRAZ, Khawar", "Quota": "40", "Enrol": "36", "Avail": "4", "Wait": "0", "Remarks": {"consent": true, "info": "> Venue: Room 2303"}}]}, "ELEC4940B": {"COURSE_INFO": {"PREVIOUS CODE": "ELEC 390B", "DESCRIPTION": "Selected topics in electronic and computer engineering studied under the supervision of a faculty member. Enrollment subject to approval by the department."}, "SECTIONS": [{"Section": "R1 (1086)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "QIU, Li", "Quota": "1", "Enrol": "0", "Avail": "1", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline: 07-Jan-2023"}}]}, "ENGG1900": {"COURSE_INFO": {"DESCRIPTION": "With the collaboration of local or non-local NGO and support from the School of Engineering, students enrolled in this program would be provided an opportunity to engage themselves in community service. Lectures, talks or training sessions will be provided to students to build up their communication skills and/or broaden their horizon. Students should also fulfill the requirements set by the NGO. At the end of the Program, students are required to submit report, reflective paper, group projects or to make a presentation as appropriate. They may also be required to make evaluation. Cantonese may be used in off-campus trainings, in some situations. Enrollment in this course requires instructor's approval. Students may not repeat the course for credits. Graded P or F. Maybe graded PP."}, "SECTIONS": [{"Section": "L1 (1038)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "WOO, Kam Tim", "Quota": "20", "Enrol": "14", "Avail": "6", "Wait": "0", "Remarks": {"consent": true, "info": "> Course sub-title: STEAM Tutor Development; > Add/Drop Deadline: 07-Jan-2023"}}]}, "ENGG3960E": {"COURSE_INFO": {"DESCRIPTION": "This course aims at providing students experiential learning experience through design teaching material for beginners in robotics. Students in this course have to work in groups. Enrollment in the project course may require instructor's approval."}, "SECTIONS": [{"Section": "L1 (1039)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "WOO, Kam Tim", "Quota": "30", "Enrol": "1", "Avail": "29", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline: 07-Jan-2023"}}]}, "ENTR3360": {"COURSE_INFO": {"ALTERNATE CODE(S)": "ISDN 3360", "PREVIOUS CODE": "ENTR 4000B", "DESCRIPTION": "This course is intended for students who want to seriously pursue technology startups. Students will be guided to identify critical steps and important milestones associated with each step in order to build a technology startup. The course requires students to take an existing project idea with early conceptual design and prototype, and bring it to the next level of project realization. Lecture topics include market research, industrial design, patent law, supply chain management and business model development. Cross-college faculty and external experts will provide individual and team mentoring for student projects. Company visits, field trips, trade shows and interactions with experienced entrepreneurs will be arranged. Students with good performance in this course are recommended to different funding and incubation opportunities. Instructor's approval is required for enrollment in the course."}, "SECTIONS": [{"Section": "L1 (1011)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LEUNG, Suk Wai Winnie", "Quota": "20", "Enrol": "2", "Avail": "18", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline : 07-Jan-2023"}}]}, "ENTR4901W": {"COURSE_INFO": {"ATTRIBUTES": "[EXP] Experiential learning", "DESCRIPTION": "Many successful IT startups begin in university years. This is a project course led by students to accelerate their entrepreneurship endeavor under the guidance and advice of a faculty member. Students work in team of size 2 to 3 to develop an idea from its scratch to become viable in market. In the process, students work on ideation, prototyping, making presentations, developing operation strategies, conducting experimental trials, designing market survey, collecting user feedbacks, writing business plan, and soft-launching and pivoting the product or services. Written reports, presentations, and/or business/operation plan are required. May be repeated for credits if different topics are taken. Instructor's approval is required for enrollment in the course."}, "SECTIONS": [{"Section": "LA1 (1005)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "TBA", "Quota": "15", "Enrol": "0", "Avail": "15", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline : 07-Jan-2023; > The class is delivered in a experiential learning mode"}}]}, "ENTR4902W": {"COURSE_INFO": {"ATTRIBUTES": "[EXP] Experiential learning", "DESCRIPTION": "Many successful IT startups begin in university years. This is a project course led by students to accelerate their entrepreneurship endeavor under the guidance and advice of a faculty member. Students work in team of size 2 to 3 to develop an idea from its scratch to become viable in market. In the process, students work on ideation, prototyping, making presentations, developing operation strategies, conducting experimental trials, designing market survey, collecting user feedbacks, writing business plan, and soft-launching and pivoting the product or services. Written reports, presentations, and/or business/operation plan are required. May be repeated for credits if different topics are taken. Instructor's approval is required for enrollment in the course."}, "SECTIONS": [{"Section": "LA1 (1007)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "TBA", "Quota": "15", "Enrol": "0", "Avail": "15", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline : 07-Jan-2023; > The class is delivered in a experiential learning mode"}}]}, "ENTR4903W": {"COURSE_INFO": {"ATTRIBUTES": "[EXP] Experiential learning", "DESCRIPTION": "Many successful IT startups begin in university years. This is a project course led by students to accelerate their entrepreneurship endeavor under the guidance and advice of a faculty member. Students work in team of size 2 to 3 to develop an idea from its scratch to become viable in market. In the process, students work on ideation, prototyping, making presentations, developing operation strategies, conducting experimental trials, designing market survey, collecting user feedbacks, writing business plan, and soft-launching and pivoting the product or services. Written reports, presentations, and/or business/operation plan are required. May be repeated for credits if different topics are taken. Instructor's approval is required for enrollment in the course."}, "SECTIONS": [{"Section": "LA1 (1008)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "TBA", "Quota": "15", "Enrol": "0", "Avail": "15", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline : 07-Jan-2023; > The class is delivered in a experiential learning mode"}}]}, "ENTR4904W": {"COURSE_INFO": {"ATTRIBUTES": "[EXP] Experiential learning", "DESCRIPTION": "Many successful IT startups begin in university years. This is a project course led by students to accelerate their entrepreneurship endeavor under the guidance and advice of a faculty member. Students work in team of size 2 to 3 to develop an idea from its scratch to become viable in market. In the process, students work on ideation, prototyping, making presentations, developing operation strategies, conducting experimental trials, designing market survey, collecting user feedbacks, writing business plan, and soft-launching and pivoting the product or services. Written reports, presentations, and/or business/operation plan are required. May be repeated for credits if different topics are taken. Instructor's approval is required for enrollment in the course."}, "SECTIONS": [{"Section": "LA1 (1010)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "TBA", "Quota": "15", "Enrol": "0", "Avail": "15", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline : 07-Jan-2023; > The class is delivered in a experiential learning mode"}}]}, "ENVR3001": {"COURSE_INFO": {"PRE-REQUISITE": "ENVR 2001", "DESCRIPTION": "This is second course of the series designed to assist students in developing attributes necessary for professional growth. This course is a one-year course designed to provide academic advising to students, to enhance their understanding of the latest environment topics, and to improve their communication skills. Students are required to attend discussion sessions with advisors and selected seminars. For EVMT students only. Graded P or F."}, "SECTIONS": [{"Section": "L1 (1068)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "TBA", "Quota": "5", "Enrol": "4", "Avail": "1", "Wait": "0", "Remarks": {"consent": false, "info": "> Add/Drop Deadline : 21-Nov-2022"}}]}, "EVSM6950A": {"COURSE_INFO": {"VECTOR": "[3 credits]", "PREVIOUS CODE": "EVSM 695A", "DESCRIPTION": "An independent project on selected topics in environmental science under the supervision of a faculty member. Participation of external organizations in these projects will be particularly encouraged. The responsibility of control, administration and assessment of the projects rests with the University. The course may be repeated once for credits. This course is for MSc students only. Approval from instructor is required."}, "SECTIONS": [{"Section": "R1 (1006)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "TBA", "Quota": "20", "Enrol": "0", "Avail": "20", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline : 07-Jan-2023; > Extended Drop Deadline : 14-Jan-2023"}}]}, "EVSM6950B": {"COURSE_INFO": {"VECTOR": "[3 credits]", "PREVIOUS CODE": "EVSM 695B", "DESCRIPTION": "An independent project on selected topics in environmental science under the supervision of a faculty member. Participation of external organizations in these projects will be particularly encouraged. The responsibility of control, administration and assessment of the projects rests with the University. The course may be repeated once for credits. This course is for MSc students only. Approval from instructor is required."}, "SECTIONS": [{"Section": "R1 (1009)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "TBA", "Quota": "10", "Enrol": "0", "Avail": "10", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline : 07-Jan-2023; > Extended Drop Deadline : 14-Jan-2023"}}]}, "GFIN5010": {"COURSE_INFO": {"VECTOR": "[2-0-0:2]", "PREVIOUS CODE": "GFIN 501", "DESCRIPTION": "This course provides an introduction to modern asset pricing theory. We begin by briefly reviewing portfolio theory. We then move on to discussing current determinants of asset prices such as cash risk and liquidity. One of the course's goals is to apply asset pricing theories to investment decision-making. A second goal is to prepare students for upcoming courses. A third goal is to build a fundamental knowledge of fixed income and derivatives products.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Apply the concept of duration and use various financial instruments to hedge the interest rate risk in a fixed-income portfolio. 2. Apply the concepts of diversification and use Markowitz portfolio selection model to search for an optimal risk-return profile for a risky portfolio. 3. Apply capital asset pricing model to earn risk-free profits from the identification of mispricing securities and to magnify profits from leverage. 4. Price different kinds of derivative securities and create synthetic financial instruments to achieve desired payoff structures."}, "SECTIONS": [{"Section": "L1 (1071)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "YU, Jialin", "Quota": "16", "Enrol": "16", "Avail": "0", "Wait": "0", "Remarks": {"consent": false, "info": "> For MSc(GFIN) students only; > Class Duration/Dates : 13-Jan-2023 to 15-Jan-2023; > Add/Drop Deadline : 13-Jan-2023"}}]}, "GFIN5400": {"COURSE_INFO": {"VECTOR": "[1-0-0:1]", "EXCLUSION": "GFIN 5030 (Prior to 2019-20)", "DESCRIPTION": "The course builds on GFIN 5010 Foundations of Investments to provide students with tools and knowledge in global asset allocation. Topics include major investable markets and players, asset allocation, performance evaluation, strategies and performance of hedge funds, and factor models.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Apply strategic asset allocation and tactical asset allocation to select the optimal asset allocation. 2. Determine asset allocation by using factor models to optimize the factor structure and to improve portfolio performance. 3. Manage risk of a portfolio using derivative securities and calculate the optimal hedge ratio. 4. Evaluate the performance of a portfolio in terms of measurement of returns, attribute return differences to investment decisions."}, "SECTIONS": [{"Section": "L1 (1072)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "BHATTACHARYA, Utpal", "Quota": "18", "Enrol": "18", "Avail": "0", "Wait": "0", "Remarks": {"consent": false, "info": "> For MSc(GFIN) students only; > Class Duration/Dates : 16-Jan-2023 to 17-Jan-2023; > Add/Drop Deadline : 16-Jan-2023"}}]}, "ISDN1011": {"COURSE_INFO": {"DESCRIPTION": "This course is designed to provide practical technical and design training to ISDN students. For ISDN students only. Graded P, PP or F."}, "SECTIONS": [{"Section": "LA1 (1036)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "CHAN, Chi Ming", "Quota": "26", "Enrol": "25", "Avail": "1", "Wait": "0", "Remarks": {"consent": false, "info": "> Add/Drop Deadline: 07-Jan-2023"}}]}, "ISDN3360": {"COURSE_INFO": {"ALTERNATE CODE(S)": "ENTR 3360", "DESCRIPTION": "This course is intended for students who want to seriously pursue technology startups. Students will be guided to identify critical steps and important milestones associated with each step in order to build a technology startup. The course requires students to take an existing project idea with early conceptual design and prototype, and bring it to the next level of project realization. Lecture topics include market research, industrial design, patent law, supply chain management and business model development. Cross-college faculty and external experts will provide individual and team mentoring for student projects. Company visits, field trips, trade shows and interactions with experienced entrepreneurs will be arranged. Students with good performance in this course are recommended to different funding and incubation opportunities. Instructor's approval is required for enrollment in the course."}, "SECTIONS": [{"Section": "L1 (1037)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LEUNG, Suk Wai Winnie", "Quota": "20", "Enrol": "4", "Avail": "16", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline: 07-Jan-2023"}}]}, "ISOM1380": {"COURSE_INFO": {"ATTRIBUTES": "Common Core (SA) for 36-credit program Common Core (SSC-SA) for 36-credit program", "DESCRIPTION": "This course describes the development of technology and innovation from social and business perspectives.  It covers the technology side of innovations, how an invention can be developed into a successful commercial product, the role of innovation in society and how innovations are created from a socioeconomic perspective.  It highlights that successful development and adoption of innovative products relies not only on the technology itself but also a complex process that is subject to the impact of cultural, political, economic and managerial factors."}, "SECTIONS": [{"Section": "L1 (1012)", "Date_N_Time": "05-JAN-2023 - 27-JAN-2023_TuThFr 09:00AM - 12:20PM; 28-JAN-2023 - 28-JAN-2023_Sa 09:00AM - 12:50PM", "Room": "Rm 2306, Lift 17-18 (111); Rm 2306, Lift 17-18 (111)", "Instructor": "HONG, Se Joon; HONG, Se Joon", "Quota": "100", "Enrol": "100", "Avail": "0", "Wait": "161", "Remarks": {"consent": false, "info": "> Add/Drop Deadline : 07-Jan-2023"}}, {"Section": "L2 (1077)", "Date_N_Time": "03-JAN-2023 - 19-JAN-2023_MoTuThFr 02:00PM - 05:20PM; 20-JAN-2023 - 20-JAN-2023_Fr 02:00PM - 05:50PM", "Room": "Rm 2306, Lift 17-18 (111); Rm 2306, Lift 17-18 (111)", "Instructor": "KIM, Yongsuk; KIM, Yongsuk", "Quota": "100", "Enrol": "100", "Avail": "0", "Wait": "67", "Remarks": {"consent": false, "info": "> Add/Drop Deadline : 05-Jan-2023"}}]}, "ISOM1700": {"COURSE_INFO": {"ATTRIBUTES": "Common Core (SA) for 36-credit program", "DESCRIPTION": "The course will focus on how business organizations should create and sustain value for different stakeholders in the society by designing, optimizing, and improving the operations. Successful businesses have demonstrated their sustainable competitiveness by maintaining a balanced view of economic prosperity, environmental stewardship, and social responsibility. This course will also examine how the changing perspectives of stakeholders (like government and consumers) affect the business decisions and operations."}, "SECTIONS": [{"Section": "L1 (1018)", "Date_N_Time": "03-JAN-2023 - 18-JAN-2023_MoTuWeThFr 09:30AM - 12:50PM", "Room": "G012, LSK Bldg (199)", "Instructor": "LAU, Ronald", "Quota": "200", "Enrol": "200", "Avail": "0", "Wait": "47", "Remarks": {"consent": false, "info": "> Add/Drop Deadline : 04-Jan-2023"}}]}, "ISOM2400": {"COURSE_INFO": {"ATTRIBUTES": "Common Core (S&T) for 36-credit program Common Core (SA) for 36-credit program", "DESCRIPTION": "This course provides a panorama review of the global information infrastructure from technology, policy, social and business perspectives. Key issues include next generation information infrastructure, Internet of things, anti-spamming legislation, universal service, digital convergence, network interconnection, the WTOâ\u0080\u0099s agreement on telecommunications, cloud computing, green ICT, and regulatory environment of multimedia services. It will also address the increasing importance of Web 2.0-enabled information infrastructure in business innovation."}, "SECTIONS": [{"Section": "L1 (1014)", "Date_N_Time": "03-JAN-2023 - 16-JAN-2023_MoTuWeThFr 02:00PM - 05:20PM; 19-JAN-2023 - 19-JAN-2023_Th 02:00PM - 05:50PM", "Room": "G012, LSK Bldg (199); TBA", "Instructor": "XU, Yan; XU, Yan", "Quota": "130", "Enrol": "130", "Avail": "0", "Wait": "46", "Remarks": {"consent": false, "info": "> Add/Drop Deadline : 04-Jan-2023"}}]}, "ISOM3400": {"COURSE_INFO": {"PRE-REQUISITE": "ISOM 2020", "EXCLUSION": "COMP 1021", "DESCRIPTION": "This course introduces programing concepts and applications with Python programming language. The applications are mainly in the domain of business analytics. The course covers topics including general programming concepts, object-oriented design, and external Python packages for data manipulation, visualization and analytics."}, "SECTIONS": [{"Section": "L1 (1016)", "Date_N_Time": "03-JAN-2023 - 26-JAN-2023_TuThFr 03:00PM - 06:20PM; 27-JAN-2023 - 27-JAN-2023_Fr 03:00PM - 06:50PM", "Room": "Rm 1007, LSK Bldg (80); Rm 1007, LSK Bldg (80)", "Instructor": "JIA, Jia; JIA, Jia", "Quota": "60", "Enrol": "37", "Avail": "23", "Wait": "0", "Remarks": {"consent": false, "info": "> Add/Drop Deadline : 05-Jan-2023"}}, {"Section": "LA1 (1017)", "Date_N_Time": "03-JAN-2023 - 27-JAN-2023_TuThFr 02:00PM - 02:50PM", "Room": "G021, LSK Bldg", "Instructor": "PANG, Ngai Cheung", "Quota": "60", "Enrol": "37", "Avail": "23", "Wait": "0", "Remarks": {"consent": false}}]}, "ISOM4740": {"COURSE_INFO": {"PRE-REQUISITE": "ISOM 2700", "DESCRIPTION": "Basic concepts and practices of enterprise resource management; popular enterprise resource planning software packages, such as SAP R/3 for discussing and building integrated business solutions."}, "SECTIONS": [{"Section": "L1 (1020)", "Date_N_Time": "03-JAN-2023 - 18-JAN-2023_MoTuWeThFr 02:00PM - 05:20PM", "Room": "G001, LSK Bldg (70)", "Instructor": "LAU, Ronald", "Quota": "60", "Enrol": "15", "Avail": "45", "Wait": "8", "Remarks": {"consent": false, "info": "> The class is delivered in a conventional face-to-face mode; > Add/Drop Deadline : 04-Jan-2023"}}]}, "ISOM5020": {"COURSE_INFO": {"VECTOR": "[2-0-0:2]", "EXCLUSION": "IMBA 5120, ISOM 5100, MBAX 5040", "PREVIOUS CODE": "ISOM 502, ISMT 502", "DESCRIPTION": "A general manager's perspective on the strategic roles of information and technology in companies, overview of enabling technologies, how information systems are developed and managed, and how to make technology management decisions.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Analyze and solve problems in Information Technology management. 2. Apply tools, analytical frameworks and general principles for managing Information Technology. 3. Identify how decision regarding Information Technology may impact other functional areas."}, "SECTIONS": [{"Section": "L1 (1044)", "Date_N_Time": "03-JAN-2023 - 10-JAN-2023_Tu 07:00PM - 10:20PM; 07-JAN-2023 - 14-JAN-2023_Sa 09:00AM - 12:20PM; 07-JAN-2023 - 14-JAN-2023_Sa 02:00PM - 05:20PM; 18-JAN-2023 - 18-JAN-2023_We 07:00PM - 10:20PM; 28-JAN-2023 - 28-JAN-2023_Sa 02:00PM - 05:20PM", "Room": "TBA; Rm 2003, LSK Bldg; Rm 2003, LSK Bldg; TBA; Rm 2003, LSK Bldg", "Instructor": "JAISINGH, Jeevan; JAISINGH, Jeevan; JAISINGH, Jeevan; JAISINGH, Jeevan; JAISINGH, Jeevan", "Quota": "77", "Enrol": "77", "Avail": "0", "Wait": "0", "Remarks": {"consent": false, "info": "> For PT-MBA Year 1 students only; > Venue on 3, 10, 18-Jan-2023: B-School Central, 15/F, HK Club Bldg, 3A Charter Rd, Central; > The class is delivered in a conventional face-to-face mode; > Add/Drop Deadline : 4-Jan-2023"}}, {"Section": "L2 (1045)", "Date_N_Time": "03-JAN-2023 - 03-JAN-2023_Tu 09:30AM - 12:50PM; 06-JAN-2023 - 06-JAN-2023_Fr 09:30AM - 12:50PM; 06-JAN-2023 - 06-JAN-2023_Fr 02:00PM - 05:20PM; 16-JAN-2023 - 18-JAN-2023_MoWe 09:30AM - 12:50PM; 16-JAN-2023 - 18-JAN-2023_MoWe 02:00PM - 05:20PM; 02-FEB-2023 - 02-FEB-2023_Th 09:30AM - 12:50PM", "Room": "Rm 2003, LSK Bldg; Rm 2003, LSK Bldg; Rm 2003, LSK Bldg; Rm 2003, LSK Bldg; Rm 2003, LSK Bldg; Rm 2003, LSK Bldg", "Instructor": "KOH, Tat Koon; KOH, Tat Koon; KOH, Tat Koon; KOH, Tat Koon; KOH, Tat Koon; KOH, Tat Koon", "Quota": "60", "Enrol": "52", "Avail": "8", "Wait": "0", "Remarks": {"consent": false, "info": "> For FT-MBA Year 1 students only; > The class is delivered in a conventional face-to-face mode; > Add/Drop Deadline : 4-Jan-2023"}}]}, "ISOM5220": {"COURSE_INFO": {"VECTOR": "[2-0-0:2]", "DESCRIPTION": "This course provides students with frameworks, concepts, and background to understand the role of regulation, compliance and assurance in FinTech markets from both technology and business perspectives. The course will also examine the perspectives of government officials, investors, managers, and consumers in how they benefit from, guide, and influence the evolution of regulation and associated compliance activities.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Identify major regulatory objectives and implications for FinTech. 2. Assess how technology influences and is influenced by regulation and markets. 3. Describe RegTech and InsurTech ecosystems to understand regulatory transformation and opportunities created by relevant technologies. 4. Examine the risks and challenges associated with technology innovations in the context of FinTech applications. 5. Discuss future directions of FinTech and its implications for their own future."}, "SECTIONS": [{"Section": "L1 (1043)", "Date_N_Time": "07-JAN-2023 - 21-JAN-2023_Sa 09:00AM - 12:50PM; 07-JAN-2023 - 21-JAN-2023_Sa 02:00PM - 07:20PM", "Room": "G001, LSK Bldg (70); G001, LSK Bldg (70)", "Instructor": "CLARK, Theodore Henry King; CLARK, Theodore Henry King", "Quota": "58", "Enrol": "58", "Avail": "0", "Wait": "5", "Remarks": {"consent": false, "info": "> For MSc(ISM) students only; > Add/Drop Deadline : 8-Jan-2023"}}]}, "ISOM5370": {"COURSE_INFO": {"VECTOR": "[2-0-0:2]", "PREVIOUS CODE": "ISOM 537, ISMT 537, ISMT 610R", "DESCRIPTION": "Technology and innovation management (TIM) plays an important role in enhancing the competitiveness of firms, industries, and even nations.  This course provides a comprehensive introduction to TIM from strategic perspectives and addresses key issues such as technology and innovation decision making, open innovation system, lead user innovation, intellectual property portfolio management, and national innovation system.  Specifically, it will highlight how technology can facilitate corporate innovation.  Students will obtain basic skills in formulating TIM-based competitive strategies.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Stimulate their curiosity and broaden their perspective by critically analyzing puzzling critical dilemmas that deny some long-held assumptions. 2. Recognize various concepts and frameworks to explain different aspects of technological innovation from the business strategy perspective. 3. Apply the concepts and theoretical frameworks learned from the course to analyze the innovation of a chosen company and propose sound and implementable recommendations to the company."}, "SECTIONS": [{"Section": "L1 (1042)", "Date_N_Time": "03-JAN-2023 - 19-JAN-2023_TuThFr 07:00PM - 10:20PM", "Room": "G001, LSK Bldg (70)", "Instructor": "KIM, Yongsuk", "Quota": "50", "Enrol": "34", "Avail": "16", "Wait": "0", "Remarks": {"consent": false, "info": "> For MSc(ISM) students only; > Add/Drop Deadline : 4-Jan-2023"}}]}, "ISOM5720": {"COURSE_INFO": {"VECTOR": "[2-0-0:2]", "EXCLUSION": "ISOM 4740", "PREVIOUS CODE": "ISOM 564, ISMT 564", "DESCRIPTION": "Concepts and practices of enterprise resource management; enterprise resource planning systems and applications, integrated systems approach to managing major business processes, business information reports and analyses.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Compare the strategic values and limitations of enterprise systems. 2. Discuss the basic concepts and practices of process-oriented management in a global, competitive environment. 3. Define the skills and knowledge to successfully implement an enterprise system in organizations. 4. Identify the new development of ERP software and applications for facilitating e-business. 5. Demonstrate examples of business process integration through the use of ERP core applications and modules. 6. Identify the tangible benefits of enterprise integration for decision making using ERP in a simulated environment."}, "SECTIONS": [{"Section": "L1 (1041)", "Date_N_Time": "03-JAN-2023 - 03-JAN-2023_Tu 06:00PM - 09:20PM; 05-JAN-2023 - 10-JAN-2023_TuTh 06:00PM - 09:20PM; 07-JAN-2023 - 14-JAN-2023_Sa 09:30AM - 12:50PM; 12-JAN-2023 - 19-JAN-2023_Th 06:00PM - 09:20PM; 17-JAN-2023 - 17-JAN-2023_Tu 06:00PM - 09:20PM", "Room": "G003, LSK Bldg (70); G005, LSK Bldg; G003, LSK Bldg (70); G003, LSK Bldg (70); G005, LSK Bldg", "Instructor": "HO, Cheuk Fan Edmond_LAU, Ronald; LAU, Ronald; LAU, Ronald; LAU, Ronald; LAU, Ronald", "Quota": "60", "Enrol": "33", "Avail": "27", "Wait": "0", "Remarks": {"consent": false, "info": "> For MSc(GO) students only; > Add/Drop Deadline : 4-Jan-2023"}}]}, "ISOM6790K": {"COURSE_INFO": {"VECTOR": "[1-0-0:1]", "DESCRIPTION": "The course introduces the business and operations transformation approach by discussing the challenges and learning from real-life business cases. It helps students bridge the gaps between academic knowledge and real-life transformation experiences. Sharing and discussing the differences and similarities of transformation across different industry sectors will be covered."}, "SECTIONS": [{"Section": "L1 (1061)", "Date_N_Time": "04-JAN-2023 - 16-JAN-2023_MoWe 06:00PM - 09:20PM", "Room": "G001, LSK Bldg (70)", "Instructor": "HO, Cheuk Fan Edmond_HUANG, Xin", "Quota": "65", "Enrol": "34", "Avail": "31", "Wait": "0", "Remarks": {"consent": false, "info": "> For MSc(GO) students only; > Add/Drop Deadline : 05-Jan-2023"}}]}, "LIFS2011": {"COURSE_INFO": {"PRE-REQUISITE": "LIFS 2060", "EXCLUSION": "OCES 2011", "DESCRIPTION": "This course engages students in practical training and enriches their knowledge in biodiversity and skills in interpretive services under ecotourism. The students will also have a chance to contribute to the society through environmental education. At the end of the course, students should gain hands-on experience in environmental conservation and improve their skills in communication, problem solving, team work, and time management. For LIFS, ENVS and OST students only. Approval of the course coordinator is needed for students to enroll in this course. Graded PP, P or F."}, "SECTIONS": [{"Section": "LA1 (1025)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "KO, Ice Wai Ping", "Quota": "15", "Enrol": "5", "Avail": "10", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline : 07-Jan-2023"}}]}, "LIFS6660": {"COURSE_INFO": {"VECTOR": "[3-0-0:3]", "PREVIOUS CODE": "BISC 666", "DESCRIPTION": "This joint course offered under the HKU-CUHK-HKUST Centre for Advanced Study will give an introduction to basic concepts as well as modern techniques and technologies in Molecular Medicine. Cancer as well as neurodegenerative diseases will be used as disease models in most of the examples covered in the course. Classes will be held in the campus of the university concerned for that part of the course offered.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Obtain basic knowledge of chromosomal abnormalities in tumour cells, methods for detection and their clinical significance. 2. Discuss the genetic basis of cancer and implications for clinical diagnosis, prognostication and disease monitoring. 3. Special topics in neuroscience/cancer biology: to focus on neuronal signaling and neurodegenerative diseases, and cell cycle control. 4. Cell signaling: to discuss the concept and techniques used in signal transduction study and its connection with cancer. 5. To obtain basic knowledge in molecular diagnostics. 6. To obtain basic concepts on the design of molecular medicine studies, including statistical considerations. 7. To obtain basic knowledge on high throughput molecular technologies, including those used in proteomics and the mass spectrometric analysis of nucleic acids."}, "SECTIONS": [{"Section": "L1 (1022)", "Date_N_Time": "07-JAN-2023 - 14-JAN-2023_Sa 10:00AM - 12:50PM; 28-JAN-2023 - 28-JAN-2023_Sa 10:00AM - 12:50PM", "Room": "TBA; TBA", "Instructor": "TBA; TBA", "Quota": "20", "Enrol": "18", "Avail": "2", "Wait": "0", "Remarks": {"consent": false, "info": "> This course is offered under a course-sharing scheme established jointly by The University of Hong Kong, The Chinese University of Hong Kong, and The Hong Kong University of Science and Technology, under the Joint Centre for Advanced Study. ; > Venue: ; - Lecture Theatre, 2/F, Lui Che Woo Clinical Sciences Building, Prince of Wales Hospital, Shatin, N.T. (10:00 - 13:00 on 7, 14, 28 Jan & 4 Feb 2023); - LTE, Academic Building, HKUST (10:00 - 12:50 on 11, 18, 25 Feb & 4 Mar 2023); - Lecture Theatre 1, 1/F, HKUMed Academic Building, 3 Sassoon Road, Hong Kong (10:30 - 13:30 on 11 Mar 2023) and Lecture Theatre, 2/F, Block T, Queen Mary Hospital, Hong Kong (10:30 - 13:30 on 18, 25 Mar & 1 Apr 2023); > Add/Drop Deadline : 11-Jan-2023"}}]}, "MAFS6100J": {"COURSE_INFO": {"VECTOR": "[3 credits]", "DESCRIPTION": "Completion of an independent project under the supervisor of a faculty in financial mathematics or statistics.  Scope may include (i) identifying a non-reference problem and proposing the methods of solution, (ii) acquiring a specific research skill."}, "SECTIONS": [{"Section": "R1 (1081)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "KWOK, Yue Kuen", "Quota": "1", "Enrol": "1", "Avail": "0", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline : 07-Jan-2023; > Extended Drop Deadline : 14-Jan-2023; > Students should seek the instructor's approval to take this course."}}]}, "MARK5120": {"COURSE_INFO": {"VECTOR": "[2-0-0:2]", "EXCLUSION": "IMBA 5050, MBAX 5050", "PREVIOUS CODE": "MARK 512", "DESCRIPTION": "Strategic marketing objectives and implementation of strategies through pricing, distribution channels, promotion and new-product decisions.  This is a core course for MBA.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Conduct a marketing environmental analysis and identify market opportunities that will be strategically fit with the company or organization. 2. Identify and evaluate segments, and decide on the appropriate target(s) within a given market. 3. Construct a persuasive value proposition and positioning statement for a given offering. 4. Formulate marketing strategies and make strategic marketing decisions, including specific marketing mix strategies. 5. Monitor and control strategic marketing plans. 6. Make effective presentations of a companyâ\u0080\u0099s or organizationâ\u0080\u0099s marketing plan."}, "SECTIONS": [{"Section": "L1 (1040)", "Date_N_Time": "07-JAN-2023 - 14-JAN-2023_Sa 09:30AM - 12:50PM; 07-JAN-2023 - 14-JAN-2023_Sa 02:30PM - 05:50PM; 08-JAN-2023 - 08-JAN-2023_Su 09:00AM - 12:20PM; 08-JAN-2023 - 08-JAN-2023_Su 02:00PM - 05:20PM; 15-JAN-2023 - 15-JAN-2023_Su 09:00AM - 12:50PM; 18-JAN-2023 - 18-JAN-2023_We 07:00PM - 08:50PM", "Room": "Rm 2001, LSK Bldg; Rm 2001, LSK Bldg; Rm 2001, LSK Bldg; Rm 2001, LSK Bldg; G001, LSK Bldg (70); Rm 2001, LSK Bldg", "Instructor": "SALVACRUZ, Joseph; SALVACRUZ, Joseph; SALVACRUZ, Joseph; SALVACRUZ, Joseph; SALVACRUZ, Joseph; SALVACRUZ, Joseph", "Quota": "65", "Enrol": "46", "Avail": "19", "Wait": "0", "Remarks": {"consent": false, "info": "> For Part-time MBA (BI-weekly) students only; > The class is delivered in a conventional face-to-face mode; > Add/Drop Deadline : 07-Jan-2023"}}]}, "MASS5983": {"COURSE_INFO": {"VECTOR": "[3-0-0:3]", "DESCRIPTION": "This course examines the psychology of well-being in the Chinese context. Students will be engaged in a series of challenges designed to enhance their understanding of well-being, to increase their happiness, and to bring about positive changes in their lives.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Recognize the various dimensions of well-being and explain them with reference to theories in psychology and other social sciences. 2. Gain insight into how research on well-being is conducted through a global and comparative perspective. 3. Explain, evaluate, and conduct research on well-being. 4. Analyze their own experience and everyday encounters regarding well-being."}, "SECTIONS": [{"Section": "L1 (1050)", "Date_N_Time": "03-JAN-2023 - 26-JAN-2023_TuWeThFr 09:00AM - 11:50AM", "Room": "TBA", "Instructor": "TBA", "Quota": "50", "Enrol": "30", "Avail": "20", "Wait": "0", "Remarks": {"consent": false, "info": "> Add/Drop Deadline : 04-Jan-2023; > Extended Drop Deadline : 07-Jan-2023; > For MA(SOSC) students only"}}]}, "MGCS5025": {"COURSE_INFO": {"ATTRIBUTES": "[BLD] Blended learning", "VECTOR": "[3-0-0:3]", "PREVIOUS CODE": "MGCS 6000G", "DESCRIPTION": "Africa's relationship with China has created a global discourse. The course will discuss the controversial topics that arise from the political economy of China-Africa links and relations between Africans and Chinese.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Have a general grasp of the global discourse on China and Africa, and its impact on Chinaâ\u0080\u0099s diplomatic relationships with other strong global forces 2. Evaluate theoretical frameworks critically by connecting them with empirical studies 3. Identify a research question on China and conduct a secondary research 4. Work in team for major assessments 5. Improve communication skills"}, "SECTIONS": [{"Section": "L1 (1004)", "Date_N_Time": "03-JAN-2023 - 17-JAN-2023_MoTuWeThFrSa 07:00PM - 08:20PM", "Room": "Rm 4582, Lift 27-28 (66)", "Instructor": "SAUTMAN, Barry Victor", "Quota": "40", "Enrol": "40", "Avail": "0", "Wait": "5", "Remarks": {"consent": false, "info": "> Add/Drop Deadline : 30-Dec-2022; > The class is delivered in a blended learning mode; > For MSc(GCS) students only"}}]}, "MGCS5037": {"COURSE_INFO": {"VECTOR": "[3-0-0:3]", "DESCRIPTION": "In this course students will learn to love everything that is special about Western classical music, from the full impressive power of a concert orchestra to the intimate and mysterious solo piano. This course is designed to introduce students to the wide variety of styles and sounds of Western classical music and to connect that music to history, exoticism, meaning, and representation. The listening and analytical skills demonstrated will bring about a deeper understanding of music as an art form. Prior musical training is NOT required.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Develop a deeper appreciation of Western classical music. 2. Analyze artistic trends and describe the cultural and historical development of classical music. 3. Understand music theory basics. 4. Critique live music performances. 5. Appreciate the elements of exoticism and representation in Western classical music."}, "SECTIONS": [{"Section": "L1 (1069)", "Date_N_Time": "04-JAN-2023 - 18-JAN-2023_MoWeFr 02:00PM - 03:50PM; 04-JAN-2023 - 20-JAN-2023_MoWeFr 10:00AM - 12:50PM; 20-JAN-2023 - 20-JAN-2023_Fr 02:00PM - 02:50PM", "Room": "LTL, CYT Bldg (354); LTL, CYT Bldg (354); LTL, CYT Bldg (354)", "Instructor": "DROSCHA, Isaac David; DROSCHA, Isaac David; DROSCHA, Isaac David", "Quota": "40", "Enrol": "40", "Avail": "0", "Wait": "29", "Remarks": {"consent": false, "info": "> Add/Drop Deadline : 05-Jan-2023; > Extended Drop Deadline : 07-Jan 2023; > For MSc(GCS) students only"}}]}, "PHYS4090A": {"COURSE_INFO": {"PRE-REQUISITE": "CGA at 2.70 or above", "DESCRIPTION": "This course covers special topics selected by the instructor on the basis of individual student's request. For students in their fourth year of study only. The instructor's approval is required for taking this course. May be repeated for credits."}, "SECTIONS": [{"Section": "T1 (1076)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "TBA", "Quota": "1", "Enrol": "1", "Avail": "0", "Wait": "0", "Remarks": {"consent": true}}]}, "PHYS6100A": {"COURSE_INFO": {"VECTOR": "[1 credit]", "DESCRIPTION": "This course covers in-depth study on topics selected by the instructor on the basis of individual postgraduate student's request. The instructor's approval is required for taking this course."}, "SECTIONS": [{"Section": "R1 (1075)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "TBA", "Quota": "1", "Enrol": "1", "Avail": "0", "Wait": "0", "Remarks": {"consent": true}}]}, "SBMT2200T": {"COURSE_INFO": {"DESCRIPTION": "The course is intended to give business undergraduate students an opportunity to gain exposure in the area of social entrepreneurship and apply their knowledge to solve real-world challenges facing these organizations. It is conducted in the form of an internship program at a designated social enterprise under the supervision of the School of Business and Management. Approval from the course coordinator is needed prior to enrolling in the course. Graded P or F. Students may repeat the course for credits if different topics are taken."}, "SECTIONS": [{"Section": "T1 (1073)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LAFON-VINAIS, Veronique J A", "Quota": "50", "Enrol": "30", "Avail": "20", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline : 07-Jan-2023"}}]}, "SBMT3200R": {"COURSE_INFO": {"DESCRIPTION": "Students apply skills and knowledge learned from business courses to focus on specific projects in a business corporation setting. Students will work on group projects sponsored by participating corporations and supervised by Faculty members. Approval from the course coordinator is needed prior to enrolling in the course. Graded PP, P or F. Students may repeat the course for credits if different topics are taken."}, "SECTIONS": [{"Section": "T1 (1051)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LAFON-VINAIS, Veronique J A", "Quota": "20", "Enrol": "5", "Avail": "15", "Wait": "0", "Remarks": {"consent": true, "info": "> Participating Corporation: adidas; > The credit load will usually be spread in the following pattern: Fall: 1; Winter: 1; > Add/Drop Deadline : 07-Jan-2023"}}, {"Section": "T2 (1052)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LAFON-VINAIS, Veronique J A", "Quota": "20", "Enrol": "5", "Avail": "15", "Wait": "0", "Remarks": {"consent": true, "info": "> Participating Corporation: MSD; > The credit load will usually be spread in the following pattern: Fall: 1; Winter: 1; > Add/Drop Deadline : 07-Jan-2023"}}, {"Section": "T3 (1053)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LAFON-VINAIS, Veronique J A", "Quota": "20", "Enrol": "5", "Avail": "15", "Wait": "0", "Remarks": {"consent": true, "info": "> Participating Corporation: Reckitt Benckiser; > The credit load will usually be spread in the following pattern: Fall: 1; Winter: 1; > Add/Drop Deadline : 07-Jan-2023"}}, {"Section": "T4 (1054)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LAFON-VINAIS, Veronique J A", "Quota": "20", "Enrol": "5", "Avail": "15", "Wait": "0", "Remarks": {"consent": true, "info": "> Participating Corporation: lululemon; > The credit load will usually be spread in the following pattern: Fall: 1; Winter: 1; > Add/Drop Deadline : 07-Jan-2023"}}]}, "SBMT3200S": {"COURSE_INFO": {"DESCRIPTION": "Students apply skills and knowledge learned from business courses to focus on specific projects in a business corporation setting. Students will work on group projects sponsored by participating corporations and supervised by Faculty members. Approval from the course coordinator is needed prior to enrolling in the course. Graded PP, P or F. Students may repeat the course for credits if different topics are taken."}, "SECTIONS": [{"Section": "T1 (1055)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LAFON-VINAIS, Veronique J A", "Quota": "20", "Enrol": "10", "Avail": "10", "Wait": "0", "Remarks": {"consent": true, "info": "> Participating Corporation: GSK; > The credit load will usually be spread in the following pattern: Winter: 1; Spring: 1; > Add/Drop Deadline : 07-Jan-2023"}}, {"Section": "T2 (1056)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LAFON-VINAIS, Veronique J A", "Quota": "20", "Enrol": "5", "Avail": "15", "Wait": "0", "Remarks": {"consent": true, "info": "> Participating Corporation: L'Oreal; > The credit load will usually be spread in the following pattern: Winter: 1; Spring: 1; > Add/Drop Deadline : 07-Jan-2023"}}, {"Section": "T3 (1057)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LAFON-VINAIS, Veronique J A", "Quota": "20", "Enrol": "5", "Avail": "15", "Wait": "0", "Remarks": {"consent": true, "info": "> Participating Corporation: foodpanda; > The credit load will usually be spread in the following pattern: Winter: 1; Spring: 1; > Add/Drop Deadline : 07-Jan-2023"}}, {"Section": "T4 (1058)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LAFON-VINAIS, Veronique J A", "Quota": "20", "Enrol": "5", "Avail": "15", "Wait": "0", "Remarks": {"consent": true, "info": "> Participating Corporation: Plaza Premium Group; > The credit load will usually be spread in the following pattern: Winter: 1; Spring: 1; > Add/Drop Deadline : 07-Jan-2023"}}]}, "SBMT3300K": {"COURSE_INFO": {"DESCRIPTION": "In each business competition, students will be required to examine the conceptual and practical aspects of business policies and policy decision making by utilizing all the concepts, theories and tools that they learned in previous courses. This 1-credit course is offered in recognition of the students' outstanding performance in their participation of business competitions. Approval from the course coordinator is needed prior to enrolling in the course. Graded P or F. Students may repeat the course for credits if different case competitions are taken."}, "SECTIONS": [{"Section": "T1 (1074)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "HUANG, Allen Hao", "Quota": "100", "Enrol": "54", "Avail": "46", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline : 07-Jan-2023"}}]}, "SBMT5300": {"COURSE_INFO": {"VECTOR": "[2-0-0:2]", "PREVIOUS CODE": "SBMT 6010B", "DESCRIPTION": "It aims at helping MBA students work intensively on developing or improving some key presentation skills which will be useful to them throughout their business careers. Simply put, the essence of Enhancing Professional Skills as â\u0080\u009cMaking a Logical, Effective and Persuasive Business Presentation\". Graded P or F.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Identify the key issues from a tangle of issues, to analyze and develop solutions. 2. Create and deliver logical, effective and persuasive business presentations. 3. Enhance communication effectiveness."}, "SECTIONS": [{"Section": "L1 (1046)", "Date_N_Time": "09-JAN-2023 - 13-JAN-2023_MoTuWeThFr 09:30AM - 08:50PM; 15-JAN-2023 - 15-JAN-2023_Su 09:00AM - 05:50PM", "Room": "Rm 2003, LSK Bldg; Rm 2003, LSK Bldg", "Instructor": "DORAN, Christopher_FRANKLIN, Laurence Craig_NASON, Stephen William_SALVACRUZ, Joseph; DORAN, Christopher_FRANKLIN, Laurence Craig_NASON, Stephen William_SALVACRUZ, Joseph", "Quota": "48", "Enrol": "43", "Avail": "5", "Wait": "0", "Remarks": {"consent": false, "info": "> For FT-MBA students only; > Add/Drop Deadline : 23-Dec-2022"}}]}, "SBMT6011K": {"COURSE_INFO": {"VECTOR": "[1-0-0:1]", "DESCRIPTION": "Sustainability is a topic of increasing focus for public and private companies around the world. With global environmental and other societal challenges increasing, and with increasing interest anticipated, trillions of dollars in market share are beginning to shift. This battle for future market share may well be won by those who respond best to this new corporate, policy and investment paradigm. Sustainability Applications in the Corporate World provides students with the experience, tools and community of practice they will need to become an important part of this global paradigm. Graded P or F."}, "SECTIONS": [{"Section": "L1 (1048)", "Date_N_Time": "06-JAN-2023 - 18-JAN-2023_WeFr 07:00PM - 10:20PM", "Room": "TBA", "Instructor": "TBA", "Quota": "50", "Enrol": "28", "Avail": "22", "Wait": "0", "Remarks": {"consent": false, "info": "> For Digital MBA students only; > Instructor: Bernard Duffy; > Add/Drop Deadline : 10-Jan-2023"}}]}, "SBMT6320A": {"COURSE_INFO": {"VECTOR": "[2 credits]", "DESCRIPTION": "This course is hosted by partner schools in different countries. The tour gives an overview of doing business, including an introduction to the economy, history, culture and legal framework of the visiting country. Typically, it will include lectures on-campus and off-campus, corporate visits and meeting with local business leaders upon a range of industry sectors which will offer students a unique synthesis between state of the art academic studies and practical, hands-on experience. It is suitable for those who are specifically interested in doing business in the visiting place in future or in international business and enhancing their international experience. Graded P or F."}, "SECTIONS": [{"Section": "R1 (1047)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "TBA", "Quota": "6", "Enrol": "6", "Avail": "0", "Wait": "0", "Remarks": {"consent": true, "info": "> For PT-MBA Year 2 or above and Part time MBA (Bi-Weekly) Year 2 or above students only; > Add/Drop Deadline : 27-Dec-2022"}}]}, "SOSC3700A": {"COURSE_INFO": {"PRE-REQUISITE": "SOSC 2400", "DESCRIPTION": "The course is intended to prepare students for the Quantitative Social Analysis Capstone Project by giving them practical experience in the quantitative analysis of social data by independently applying skills acquired in their required and elective methods courses. Students will either conduct a small research project related to the theme of a topical course in the Division of Social Science in which they are concurrently enrolled, or complete an internship that involves application of skills learned in their methods courses. Enrolled students will meet as a class at regular intervals during the semester and submit a final report. Students who plan to carry out a project are expected to be simultaneously enrolled in a topical Social Science course. Graded P or F. May be only taken twice. For QSA students only. Instructor's approval is required for enrolling in the course."}, "SECTIONS": [{"Section": "LA1 (1001)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "HE, Wenkai", "Quota": "10", "Enrol": "0", "Avail": "10", "Wait": "0", "Remarks": {"consent": true, "info": "> Add./Drop Deadline : 07-Jan-2023"}}]}, "SOSC3700B": {"COURSE_INFO": {"PRE-REQUISITE": "SOSC 2400", "DESCRIPTION": "The course is intended to prepare students for the Quantitative Social Analysis Capstone Project by giving them practical experience in the quantitative analysis of social data by independently applying skills acquired in their required and elective methods courses. Students will either conduct a small research project related to the theme of a topical course in the Division of Social Science in which they are concurrently enrolled, or complete an internship that involves application of skills learned in their methods courses. Enrolled students will meet as a class at regular intervals during the semester and submit a final report. Students who plan to carry out a project are expected to be simultaneously enrolled in a topical Social Science course. Graded P or F. May be only taken twice. For QSA students only. Instructor's approval is required for enrolling in the course."}, "SECTIONS": [{"Section": "LA1 (1002)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "HE, Wenkai", "Quota": "10", "Enrol": "5", "Avail": "5", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline : 07-Jan-2023"}}]}, "SOSC5170": {"COURSE_INFO": {"VECTOR": "[3-0-0:3]", "PRE-REQUISITE": "SOSC 5110", "PREVIOUS CODE": "SOSC 517", "DESCRIPTION": "This course explores links between theory and practice in qualitative research. It combines learning about selected methods of qualitative inquiry (participant-observation, in-depth interview, oral history) and analysis (grounded theory, ethnography, and discourse analysis). Enrollment by students from outside the Division of Social Science by instructor permission.", "INTENDED_LEARNING_OUTCOMES": "On successful completion of the course, students will be able to: 1. Demonstrate capability to creative thinking by critically reviewing the progress in qualitative methodology and the up-to-date empirical studies of using these qualitative methods. 2. Identify the causal reasoning in qualitative studies which are similar to that in quantitative analysis in social science. 3. Develop the ability to come up with high-quality research proposal for their thesis work."}, "SECTIONS": [{"Section": "L1 (1003)", "Date_N_Time": "03-JAN-2023 - 03-JAN-2023_Tu 10:30AM - 12:20PM; 03-JAN-2023 - 03-JAN-2023_Tu 01:30PM - 03:20PM; 04-JAN-2023 - 30-JAN-2023_MoWeFr 10:30AM - 11:50AM; 04-JAN-2023 - 30-JAN-2023_MoWeFr 01:30PM - 03:20PM", "Room": "Rm 2302, Lift 17-18 (74); Rm 2302, Lift 17-18 (74); Rm 2302, Lift 17-18 (74); Rm 2302, Lift 17-18 (74)", "Instructor": "ZHENG, Wenjuan; ZHENG, Wenjuan; ZHENG, Wenjuan; ZHENG, Wenjuan", "Quota": "20", "Enrol": "6", "Avail": "14", "Wait": "0", "Remarks": {"consent": false, "info": "> Add/Drop Deadline : 05-Jan-2023; > Extended Drop Deadline : 07-Jan-2023"}}]}, "TEMG1010": {"COURSE_INFO": {"DESCRIPTION": "A compulsory course for students enrolling in the Dual Degree Program in Technology and Management throughout their five years of study. This course is designed to provide academic advising to students, to enhance their personal and professional skills, to improve their understanding of latest business and technology development and to improve their communication skills. Activities involve executive forums, workshops and mentoring program. Graded P or F."}, "SECTIONS": [{"Section": "T1 (1079)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LIN, Betty Fwei-chien", "Quota": "30", "Enrol": "2", "Avail": "28", "Wait": "0", "Remarks": {"consent": false, "info": "> Add/Drop Deadline: 07-Jan-2023"}}]}, "TEMG4940A": {"COURSE_INFO": {"DESCRIPTION": "Students will be assigned to one of the 2 research topics. Topic (1) DeFi Recommendations - Decentralized Finance protocols are specialized autonomous programs to replace traditional ways of delivering finance applications. Students are to research into DeFi and make recommendations for UBSâ\u0080\u0099s consideration. Topic (2) Synapse Business Case â\u0080\u0093 HKEx Synapse is a new integrated settlement solution for Northbound Stock Connect. It is to complement the existing post-trade infrastructure using DAML smart contract technology by standardizing and streamline post-trade workflows. Students are to develop a business case for whether UBS should migrate to Synapse. Instructor consent is required for this course."}, "SECTIONS": [{"Section": "L1 (1084)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LIN, Betty Fwei-chien", "Quota": "30", "Enrol": "16", "Avail": "14", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline: 07-Jan-2023"}}]}, "TEMG4940B": {"COURSE_INFO": {"DESCRIPTION": "The VC/PE market is increasing globally with the number of unicorns grown from 1 in 2011 to more than a thousand in 2022. APAC continues to be large driver of New Economy companies. In anticipation of fast growth of UBSâ\u0080\u0099s private equity investment business in Singapore, students are asked to develop a chatbot using MS Azure CLU platform to provide responses to queries related to venture capital in APAC. Queries can be on topics such as recent deal activities, funding in a particular geography, sector specific information, etc. Instructor consent is required for this course."}, "SECTIONS": [{"Section": "L1 (1085)", "Date_N_Time": "TBA", "Room": "TBA", "Instructor": "LIN, Betty Fwei-chien", "Quota": "30", "Enrol": "7", "Avail": "23", "Wait": "0", "Remarks": {"consent": true, "info": "> Add/Drop Deadline: 07-Jan-2023"}}]}}